Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: ?php $input = "what do ya want for nothing ?"; $hash = mhash (MHASH_MD5, $input); print "The hash is ".bin2hex ($hash)." br / \n"; $hash = mhash (MHASH_MD5, $input, "Jefe"); print "The hmac is ".bin2hex ($hash). "br / \n";?
pt_br: ?php $input = "what do ya want for nothing ?"; $hash = mhash (MHASH_MD5, $input); print "A hash é ".bin2hex ($hash)." br / \n"; $hash = mhash (MHASH_MD5, $input, "Jefe"); print "A hmac é ".bin2hex ($hash). "br / \n";?

source: This will produce:
pt_br: Este código irá produzir:

source: The hash is d03cb659cbf9192dcd066272249f8412 The hmac is 750c783e6ab0b503eaa86e310a5db738
pt_br: A hash é d03cb659cbf9192dcd066272249f8412 A hmac é 750c783e6ab0b503eaa86e310a5db738

source: See the source code for further historic and copyright information.
pt_br: Requisitos

source: This file also part of most recent Linux distributions and usually stored in the / usr / share / misc directory.
pt_br: Configuração durante execução

source: Ming provides some insulation from the mundane details of the SWF file format, wrapping the movie elements in PHP objects.
pt_br: As contantes abaixo são definidas por esta extensão e somente estarão disponíveis quando a extensão foi compilada com o PHP ou carregada dinamicamente durante a execução.

source: Also, Ming is still being maintained; if there's a feature that you want to see, just let us know ming@opaque.net.
pt_br: As classes abaixo são definidas por esta extensão e somente estarão disponíveis quando a extensão for compilada junto com o PHP, ou carregada dinamicamente na execução.

source: Ming was added in PHP 4.0.5.
pt_br: SWFBitmap - getWidth - - Returns the bitmap 's width.

source: To use Ming with PHP, you first need to build and install the Ming library.
pt_br: SWFDisplayItem - move - - Moves object in relative coordinates.

source: Source code and installation instructions are available at the Ming home page: http: / /ming.sourceforge.net / along with examples, a small tutorial, and the latest news.
pt_br: SWFDisplayItem - multColor - - Multiplies the item 's color transform.

source: Download the ming archive.
pt_br: SWFDisplayItem - scale - - Scales the object in relative coordinates.

source: Unpack the archive.
pt_br: SWFDisplayItem - setDepth

source: Go in the Ming directory. make. make install.
pt_br: SWFDisplayItem - - Creates a new displayitem object.

source: This will build libming.so and install it into / usr / lib /, and copy ming.h into / usr / include /.
pt_br: SWFMovie - nextframe - - Moves to the next frame of the animation.

source: Edit the PREFIX= line in the Makefile to change the installation directory.
pt_br: SWFMovie - remove - - Removes the object instance from the display list.

source: Example 1. built into php (unix)
pt_br: SWFMovie - setbackground - - Sets the background color.

source: mkdir phpdir / ext / ming cp php_ext / * phpdir / ext / ming cd phpdir. / buildconf. / configure --with-ming other config options
pt_br: SWFMovie - setframes - - Sets the total number of frames in the animation.

source: Now either just add extension=php_ming.so to your php.ini file, or put dl( 'php_ming.so'); at the head of all of your Ming scripts.
pt_br: SWFShape - addFill - - Adds a solid fill to the shape.

source: The classes below are defined by this extension, and will only be available when the extension has either been compiled into PHP or dynamically loaded at runtime.
pt_br: SWFTextField - setLeftMargin - - Sets the left margin width of the text field.

source: Ming introduces 13 new objects in PHP, all with matching methods and attributes.
pt_br: SWFTextField - setMargins - - Sets the margins width of the text field.

source: To use them, you need to know about objects.
pt_br: SWFTextField - - Creates a text field object

source: These functions were placed here because none of the other categories seemed to fit.
pt_br: Introdução

source: Misc.
pt_br: Tabela 1.

source: Configuration Options
pt_br: Opções de Configuração

source: TRUE by default.
pt_br: TRUE por padrão.

source: If changed to FALSE scripts will be terminated as soon as they try to output something after a client has aborted their connection.
pt_br: Veja também ignore_user_abort().

source: See also ignore_user_abort().
pt_br: Cores para o modo de destaque da sintaxe.

source: Colors for Syntax Highlighting mode.
pt_br: Qualquer coisa aceitável em font color="?????? "deve funcionar.

source: Anything that' s acceptable in font color="?????? "would work.
pt_br: Nome (ex: browscap.ini )e localização do arquivo com as capacidades do browser.

source: Name (e.g.: browscap.ini )and location of browser capabilities file.
pt_br: Tipos Resource

source: See also get_browser().
pt_br: Esta extensão não possui nenhum tipo resource.

source: Thus, if you use mnoGoSearch with MySQL, during PHP configuration you have to indicate the directory of your MySQL installation, that was used during mnoGoSearch configuration, i.e. for example: --with-mnogosearch --with-mysql= / usr.
pt_br: Configuração durante execução

source: msession is an interface to a high speed session daemon which can run either locally or remotely.
pt_br: Mohawk Software session handler functions

source: To enable Msession support configure PHP --with-msession[ =DIR], where DIR is the Msession install directory.
pt_br: Configuração durante execução

source: More information about mSQL can be found at http: / /www.hughes.com.au /.
pt_br: Requisitos

source: Table 1. mSQL configuration options
pt_br: Tabela 1. mSQL configuration options

source: The maximum number of mSQL connections per process, including persistent connections.
pt_br: Tipos Resource

source: These functions allow you to access MS SQL Server database.
pt_br: Funções Microsoft SQL Server

source: Requirements for WIn32 platforms.
pt_br: Introdução

source: The extension requires the MS SQL Client Tools to be installed on the system where PHP is installed.
pt_br: Nota:

source: The Client Tools can be installed from the MS SQL Server CD or by copying ntwdblib.dll from \winnt\system32 on the server to \winnt\system32 on the PHP box.
pt_br: Você pode usar a extensão Sybase para conectar com banco de dados MSSQL de outras plataformas.

source: Copying ntwdblib.dll will only provide access.
pt_br: Requisitos

source: Requirements for Unix / Linux platforms.
pt_br: A extensão requer que as ferramentas de cliente do MS SQL sejam instaladas no sistema onde o PHP esta instalado.

source: Source code and installation instructions are available at the FreeTDS home page: http: / /www.freetds.org /
pt_br: Copiar ntwdblib.dll irá somente prover acesso.

source: The MSSQL extension is enabled by adding extension=php_mssql.dll to php.ini.
pt_br: Instalação

source: To get these functions to work, you have to compile PHP with --with-mssql[ =DIR], where DIR is the FreeTDS install prefix.
pt_br: Configuração durante execução

source: MS SQL Server configuration options
pt_br: Opções de configuração do MS SQL Server

source: These functions allow you to access MySQL database servers.
pt_br: MySQL

source: More information about MySQL can be found at http: / /www.mysql.com /.
pt_br: Estas funções permitem acessar os servidores de banco de dados do MYSQL.

source: Documentation for MySQL can be found at http: / /www.mysql.com / documentation /.
pt_br: Maiores informações podem ser encontradas em http: / /www.mysql.com /.

source: In order to have these functions available, you must compile PHP with MySQL support.
pt_br: Documentação para MySQL pode ser encontrada em http: / /www.mysql.com / documentation /.

source: By using the --with-mysql[ =DIR] configuration option you enable PHP to access MySQL databases.
pt_br: Para ter estas funções disponiveis, você deve compilar o PHP com suporte a MySQL.

source: If you use this option without specifying the path to MySQL, PHP will use the built-in MySQL client libraries.
pt_br: Usando a opção de configuração --with-mysql você permite ao PHP acessar banco de dados do MySQL.

source: With PHP 4 MySQL support is always enabled; if you don't specify the configure option, the bundled libraries are used.
pt_br: Se você usar esta opção sem especificar o caminho para o MySQL, o PHP usará as bibliotecas do cliente que vem com ele.

source: Users who run other applications that use MySQL (for example, running PHP 3 and PHP 4 as concurrent apache modules, or auth-mysql) should always specify the path to MySQL: --with-mysql= / path / to / mysql.
pt_br: Com o PHP4, o suporte a MySQL esta sempre ativado; se você não especificar a opção de configuração, as bibliotecas que vem com o PHP serão usadas.

source: Crashes and startup problems of PHP may be encountered when loading this extension in conjunction with the recode extension.
pt_br: Veja a extensão recode para maiores informações.

source: See the recode extension for more information.
pt_br: Configuração durante execução

source: MySQL Configuration Options
pt_br: Opções de configuração do MySQL

source: Whether to allow persistent connections to MySQL.
pt_br: Quando permitir conexões persistentes para o MySQL.

source: The maximum number of persistent MySQL connections per process.
pt_br: O número máximo de conexões persistentes com o MySQL por processo.

source: The maximum number of MySQL connections per process, including persistent connections.
pt_br: O número maximo de conexões com o MYSQL por processo, incluindo conexões persistentes.

source: The default TCP port number to use when connecting to the database server if no other port is specified.
pt_br: O número padrão da porta TCP a usar quando conectar com o servidor do banco de dados se nenhuma outra porta for especificada.

source: If no default is specified, the port will be obtained from the MYSQL_TCP_PORT environment variable, the mysql-tcp entry in / etc / services or the compile-time MYSQL_PORT constant, in that order.
pt_br: Se nenhum padrão for especificado, aporta será obtida da variavel de ambiente MYSQL_TCP_PORT, da entrada mysql-tcp em / etc / services ou da constante da compilação MYSQL_PORT, nesta ordem.

source: Win32 will only use the MYSQL_PORT constant.
pt_br: Windows irá usar somente a constante MYSQL_PORT.

source: The default socket name to use when connecting to a local database server if no other socket name is specified.
pt_br: O nome padrão do socket para usar quando conectar com um servidor de banco de dados local se outro nome de socket não for especificado.

source: The default server host to use when connecting to the database server if no other host is specified.
pt_br: O servidor padrão para usar quando conectar com um servidor de banco de dados se outro servidor não for encontrado.

source: Doesn 't apply in safe mode.
pt_br: Não se aplica em safe mode.

source: The default user name to use when connecting to the database server if no other name is specified.
pt_br: O nome padrão de usuário para conectar ao servidor de banco de dados se outro nome não for especificado.

source: The default password to use when connecting to the database server if no other password is specified.
pt_br: A senha padrão para usar ao conectar ao servidor de banco de dados se outra senha não for especificada.

source: Connect timeout in seconds.
pt_br: Limite de tempo da conexão em segundos.

source: On Linux this timeout is also used for waiting for the first answer from the server.
pt_br: No Linux este limite é também usado para a espera da primeira resposta do servidor.

source: There are two resource types used in the MySQL module.
pt_br: Há dois tipos de recursos usados no modulo MySql.

source: The first one is the link identifier for a database connection, the second a resource which holds the result of a query.
pt_br: O primeiro é a identificação do link da conexão com o banco de dados, o segundo é o que guarda o resultado de uma query.

source: The following constants are defined:
pt_br: Desde PHP 4.3.0 é possivel especificar opções adicionais para as funções mysql_connect() and mysql_pconnect() As seguintes constantes são definidas:

source: MySQL client constants
pt_br: Constante do cliente MySQL

source: constant
pt_br: constante

source: description
pt_br: descrição

source: use compression protocol
pt_br: usa o protocolo de compressão

source: Allow space after function names
pt_br: Permite espaço após o nome de função

source: Allow interactive_timeout seconds (instead of wait_timeout) of inactivity before closing the connection.
pt_br: Permite interactive_timeout segundos (ao inves de wait_timeout) de inatividade antes de fechar a conexão.

source: The function mysql_fetch_array() uses a constant for the different types of result arrays.
pt_br: A função mysql_fetch_array() usa uma constante para cada diferentes tipos de matrizes de resultado.

source: Columns are returned into the array having the fieldname as the array index.
pt_br: As colunas são retornadas na matriz tendo o nome do campo como índice da matriz.

source: Columns are returned into the array having both a numerical index and the fieldname as the array index.
pt_br: As colunas são retornadas na matriz tendo ambos os indices: um numérico e o um com o nome do campo.

source: Columns are returned into the array having a numerical index to the fields.
pt_br: As colunas são retornadas numa matriz tendo um indice numérico dos campos.

source: This index starts with 0, the first field in the result.
pt_br: Este indice começa com 0, o primeiro campo no resultado.

source: This simple example shows how to connect, execute a query, print resulting rows and disconnect from a MySQL database.
pt_br: Este exemplo simples mostra como conectar, executar uma query, mostrar o resultado e desconectar do banco de dados do MySQL.

source: MySQL extension overview example
pt_br: Exemplo da extensão do MySQL

source: ?php / * Connecting, selecting database * / $link = mysql_connect( "mysql_host", "mysql_user", "mysql_password") or die("Could not connect"); print "Connected successfully"; mysql_select_db("my_database") or die("Could not select database"); / * Performing SQL query * / $query = "SELECT * FROM my_table"; $result = mysql_query($query) or die("Query failed"); / * Printing results in HTML * / print "table \n"; while ($line = mysql_fetch_array($result, MYSQL_ASSOC)) {print "\t tr \n"; foreach ($line as $col_value) {print "\t\t td $col_value / td \n";} print "\t / tr \n";} print" / table \n"; / * Free resultset * / mysql_free_result($result); / * Closing connection * / mysql_close($link);?
pt_br: ?php / * Conectando, escolhendo o banco de dados * / $link = mysql_connect( "mysql_host", "mysql_user", "mysql_password") or die("Não pude conectar"); print "Conexão bem sucedida"; mysql_select_db("my_database") or die("Não pude selecionar o banco de dados"); / * Fazendo a query SQL* / $query = "SELECT * FROM my_table"; $result = mysql_query($query) or die("Query falhou"); / * Mostrando os resultados em HTML * / print "table \n"; while ($line = mysql_fetch_array($result, MYSQL_ASSOC)) {print "\t tr \n"; foreach ($line as $col_value) {print "\t\t td $col_value / td \n";} print "\t / tr \n";} print" / table \n"; / * Liberando o resultado * / mysql_free_result($result); / * Fechando a conexão * / mysql_close($link);?

source: ncurses (new curses) is a free software emulation of curses in System V Rel 4.0 (and above).
pt_br: Ncurses terminal screen control functions

source: Download the latest version from the ftp: / /ftp.gnu.org / pub / gnu / ncurses / or from an other GNU-Mirror.
pt_br: Instalação

source: To get these functions to work, you have to compile the CGI or CLI version of PHP with --with-ncurses[ =DIR].
pt_br: Configuração durante execução

source: Table 2. ncurses color constants
pt_br: Tabela 2. ncurses color constants

source: magenta - supported when terminal is in color mod
pt_br: Keys

source: Table 3. ncurses key constants
pt_br: Tabela 3. ncurses key constants

source: Table 4. mouse constants
pt_br: Tabela 4. mouse constants

source: Network Configuration Options
pt_br: O comportamento dessas funções podem ser modificado pelas configurações do php.ini.

source: At runtime, you can define these variables by calling define_syslog_variables().
pt_br: Esta extensão não possui nenhum tipo resource.

source: Table 2. openlog() Options
pt_br: Tabela 2. openlog() Options

source: Table 3. syslog() Priorities (in descending order)
pt_br: Tabela 3. syslog() Priorities (in descending order)

source: Table 4. dns_get_record() Options
pt_br: Tabela 4. dns_get_record() Options

source: None besides functions from standard Unix libraries which are always available (either libc or libnsl, configure will detect which one to use).
pt_br: Instalação

source: To get these functions to work, you have to configure PHP with --enable-yp.
pt_br: Configuração durante execução

source: In fact object aggregation can be more flexible, in which we can select what methods or properties to "inherit" in the aggregated object.
pt_br: Exemplos

source: Example 3. storage_classes.inc
pt_br: Exemplo 3. storage_classes.inc

source: Example 4. test_aggregation.php
pt_br: Exemplo 4. test_aggregation.php

source: These functions allow you to access Oracle8 and Oracle7 databases.
pt_br: Oracle 8 functions

source: It supports binding of global and local PHP variables to Oracle placeholders, has full LOB, FILE and ROWID support and allows you to use user-supplied define variables.
pt_br: Requisitos

source: Please note that on some systems like UnixWare it is libthread instead of libpthread.
pt_br: Instalação

source: You have to compile PHP with the option --with-oci8[ =DIR], where DIR defaults to your environmment variable ORACLE_HOME.
pt_br: Esta extenção não define nenhum parâmetro de configuração no php.ini.

source: Specifies the number of bytes returned to variables.
pt_br: Esta extensão não possui nenhum tipo resource.

source: Handling of binary data.
pt_br: Constantes Predefinidas

source: PHP-4.0.4pl1 requires OpenSSL = 0.9.6, but PHP-4.0.5 and greater will also work with OpenSSL = 0.9.5.
pt_br: Instalação

source: Note that it is possible to override the default path from the script using the configargs of the functions that require a configuration file.
pt_br: Esta extenção não define nenhum parâmetro de configuração no php.ini.

source: For private keys, you may also use the syntax array( $key, $passphrase) where $key represents a key specified using the file: / / or textual content notation above, and $passphrase represents a string containing the passphrase for that private key
pt_br: Certificate Verification

source: This extension adds support for Oracle database server access.
pt_br: Introdução

source: The Output Control functions allow you to control when output is sent from the script.
pt_br: Introdução

source: The Output Control functions do not affect headers sent using header() or setcookie(), only functions such as echo() and data between blocks of PHP code.
pt_br: Requisitos

source: This value defaults to TRUE when operating under the CLI SAPI.
pt_br: Tipos Resource

source: See also ob_implicit_flush().
pt_br: Esta extensão não possui nenhum tipo resource.

source: Output Control example
pt_br: Exemplo 1.

source: When upgrading from PHP 4.1 (and 4.2) to 4.3 that due to a bug in earlier versions you must ensure that implict_flush is OFF in your php.ini, otherwise any output with ob_start() will be not be hidden from output.
pt_br: Veja Também

source: The purpose of this extension is to allow overloading of object property access and method calls.
pt_br: Sobrecarga de propriedades e métodos de objetos

source: Only one function is defined in this extension, overload() which takes the name of the class that should have this functionality enabled.
pt_br: O propósito desta extensão é permitir a sobrecarga de propriedades de acesso e metodos de objetos.

source: The class named has to define appropriate methods if it wants to have this functionality: __get(), __set() and __call() respectively for getting / setting a property, or calling a method.
pt_br: A classe especificada tem que definir os metodos para ter esta funcionalidade: __get(), __set() e __call() respectivamente para leitura / escrita das propriedades, ou chamar um metodo.

source: This way overloading can be selective.
pt_br: Desta forma a sobrecarga pode ser seletiva:

source: Inside these handler functions the overloading is disabled so you can access object properties normally.
pt_br: Dentro destas funções a sobrecarga é desabilitada de forma que você possa acessar propriedades do objeto normalmente.

source: In order to use these functions, you must compile PHP with the --enable-overload In order to use these functions, you must compile PHP with the --enable-overload option.
pt_br: Nenhuma biblioteca externa é necessária para compilar esta extensão.

source: Starting with PHP 4.3.0 this extension is enabled by default.
pt_br: Instalação

source: Builtin support for overload is available with PHP 4.3.0.
pt_br: Esta extensão não possui nenhum tipo resource.

source: Some simple examples on using the overload() function:
pt_br: Alguns exemplos simples da utilização da função overload():

source: Overloading a PHP class
pt_br: Sobrecarga de uma classe no PHP

source: ?php class OO {var $a = 111; var $elem = array('b '= 9, 'c' = 42); / / Callback method for getting a property function __get($prop_name, $prop_value) {if (isset($this - elem[$prop_name])) {$prop_value = $this - elem[$prop_name]; return true;} else {return false;}} / / Callback method for setting a property function __set($prop_name, $prop_value) {$this - elem[$prop_name] = $prop_value; return true;}} / / Here we overload the OO object overload('OO'); $o = new OO; print "\$o - a: $o - a\n"; / / print: $o - a: print "\$o - b: $o - b\n"; / / print: $o - b:
pt_br: ?php class OO {var $a = 111; var $elem = array('b '= 9, 'c' = 42); / / Metodo callback para pegar uma propriedade function __get($prop_name, $prop_value) {if (isset($this - elem[$prop_name])) {$prop_value = $this - elem[$prop_name]; return true;} else {return false;}} / / Metodo callback para definir uma propriedade function __set($prop_name, $prop_value) {$this - elem[$prop_name] = $prop_value; return true;}} / / Aqui nós sobrecarregamos o objeto OO overload('OO'); $o = new OO; print "\$o - a: $o - a\n"; / / imprime: $o - a: print "\$o - b: $o - b\n"; / / imprime: $o - b:

# 9 print "$o - c: $o - c "; / / print: $o - c:
source: 9 print "\$o - c: $o - c\n"; / / print: $o - c:
pt_br: 9 print "\$o - c: $o - c\n"; / / imprime: $o - c:

source: 42 print "\$o - d: $o - d\n"; / / print: $o - d: / / add a new item to the $elem array in OO $o - x = 56; / / instantiate stdclass (it is built-in in PHP 4) / / $val is not overloaded! $val = new stdclass; $val - prop = 555; / / Set "a" to be an array with the $val object in it / / But __set() will put this in the $elem array $o - a = array($val); var_dump($o - a[0] - prop);?
pt_br: 42 print "\$o - d: $o - d\n"; / / imprime: $o - d: / / adicionar um novo intem para o array $elem em OO $o - x = 56; / / iniciar stdclass (é integrada no PHP 4) / / $var não é sobrecarregada! $val = new stdclass; $val - prop = 555; / / Que "a" seja um array com o objeto $val dentro dele / / mas __set() o colocará no array $elem $o - a = array($val); var_dump($o - a[0] - prop);?

source: As this is an experimental extension, not all things work.
pt_br: Como esta é uma extensão experimental, nem todas as coisas funcionam.

source: There is no __call() support currently, you can only overload the get and set operations for properties.
pt_br: Não existe ainda suporte para __call() Não existe ainda suporte para __call() e você somente pode fazer a sobrecaraga das operações get e set para propriedades.
